import { defineConfig } from 'vitest/config';
import react from '@vitejs/plugin-react';
import player from 'play-sound';


function gladosPlugin(PORT : string) {
  return {
    name: 'glados-banner',
    configureServer() {
      console.clear();
      const asciiArt = `
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣽⠤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡞⣷⣽⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡹⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⣻⣿⣿⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢧⠞⣧⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣟⣾⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣧⠀⣠⣶⣖⣶⣤⡤⣀⡀⠀⠀⠀⠀
    ⠛⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣞⣿⣿⡿⢏⠹⣯⠛⠒⠯⣕⡢⣄⠀
    ⠀⠈⠳⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣘⠀⠀⠀⠀⠂⠀⠉⢢⢇
    ⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣵⡀⠀⠀⠀⠀⠀⠀⠈⢿
    ⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⡓⢀⡀⢀⡀⠀⠀⠀⠀⢸
    ⠀⠀⠀⠀⠀⠀⠙⢟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣟⣟⣿⣿⣟⠿⣿⡷⣭⣿⣿⣿⣿⣿⢲⢦⣿⣷⣶⣦⡄⠀⠀⢀⢸
    ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠿⣻⣿⣿⠿⠿⣿⣛⠥⠒⠋⠁⠀⠈⠙⠿⣿⣶⣭⣺⢽⣿⣿⣿⣿⢏⣮⣿⣿⣿⣿⣿⣿⡆⠀⡘⡏
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠷⣿⣿⣿⣿⣣⣿⣿⣋⣽⣿⣿⣿⠠⢰⢿⠁
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⢿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣇⠧⣟⡿⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣎⡿⡿⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡽⠁⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢟⡞⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⢿⣿⣿⣿⣿⣻⠟⢉⠀⠀⠀⠀⠀
    `;
    const frames = [
      '░░░░░░░░░░ 0%',
      '█░░░░░░░░░ 10%',
      '██░░░░░░░░ 20%',
      '███░░░░░░░ 30%',
      '████░░░░░░ 40%',
      '█████░░░░░ 50%',
      '██████░░░░ 60%',
      '███████░░░ 70%',
      '████████░░ 80%',
      '█████████░ 90%',
      '██████████ 100%',
      '█████████░ 90%',
      '████████░░ 80%',
      '███████░░░ 70%',
      '██████░░░░ 60%',
      '█████░░░░░ 50%',
      '████░░░░░░ 40%',
      '███░░░░░░░ 30%',
      '██░░░░░░░░ 20%',
      '█░░░░░░░░░ 10%',
      '░░░░░░░░░░ 0%',
    ];
    let i = 0;
    console.clear();
    console.log(asciiArt);
    console.log('💬 GLaDOS: Initializing data stream...');
    setInterval(() => {
      process.stdout.write(`\r Funcionamiento del puerto ${frames[i]} `);
      i = (i + 1) % frames.length;
    }, 100);
    console.log(`Tu código funciona. Por ahora. No te acostumbres`);
    console.log(`El FrontEnd de KioscoApp esta operativo en el puerto ${PORT}`);
    
    const play = player();
      play.play('/home/lau/.config/GitKraken/scripts/glados/resources/voices/general/felicitaciones.wav', (err: any) => {
        if (err) console.error('💥 Error al reproducir audio:', err);
      });

    }
  };
}

// https://vite.dev/config/
export default defineConfig({
  plugins: [react(), gladosPlugin('5173')],
  test: {
    globals: true,
    environment: 'jsdom',
    // setupFiles: './setupTests.js',
  },
  server: {
    port: 5173,
    }
  })
