
//─────────────────────────────── Line ───────────────────────────────//

export enum UnderlineVariant {
  None = 'none',
  Underline = 'underline',
}

//─────────────────────────────── 📱💻🖥️ size 📱💻🖥️ ───────────────────────────────//

export enum Breakpoint {
  Xs = 'xs',
  Sm = 'sm',
  Md = 'md',
  Lg = 'lg',
  Xl = 'xl',
}

//─────────────────────────────── 🍫 Snack Bar 🍫 ───────────────────────────────//

export enum AlertColor {
  Success = 'success',
  Error = 'error',
  Warning = 'warning',
  Info = 'info',
}
